src/cf/src/Catalogs/СценарииОбработкиЗадач/СценарииОбработкиЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СценарииОбработкиЗадач</name>
  <predefined>
    <items>
      <name>БазовыйСценарийЗадач</name>
      <description>Базовый сценарий задач</description>
    </items>
  </predefined>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЭтапыСостояний</name>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>CatalogRef.СостоянияЗадач</types>
      </type>
    </attributes>
    <attributes>
      <name>НачальноеПоУмолчанию</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПереходыПоСостояниям</name>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>CatalogRef.СостоянияЗадач</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеПерехода</name>
      <type>
        <types>CatalogRef.СостоянияЗадач</types>
      </type>
    </attributes>
    <attributes>
      <name>ОсновнойПереход</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/Catalogs/СценарииОбработкиЗадач/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	// Очистка переходов по состояниям без этапов состояний
	ОчисткаПереходовПоСостояниямБезЭтапов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Очистка переходов по состояниям без этапов состояний
Процедура ОчисткаПереходовПоСостояниямБезЭтапов()

	КолСтрокИсходное = ПереходыПоСостояниям.Количество();
	индекс = 1; сч = 0;
	Пока индекс <= КолСтрокИсходное Цикл
		
		СтрокаСостояния = ЭтапыСостояний.Найти(ПереходыПоСостояниям[сч].Состояние,"Состояние");
		
		Если СтрокаСостояния = Неопределено Тогда
			ПереходыПоСостояниям.Удалить(ПереходыПоСостояниям[сч]);    
		Иначе
			сч = сч + 1;    
		КонецЕсли;
		
		индекс = индекс + 1;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
